app/controllers/tweeets_controller.rb

  def index
    # To display them in specific order it goes right after Tweeet.all figure out how to with PG
    @tweeets = Tweeet.all.order('created_at DESC')
---
SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC

  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save
---
INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweeet", "hola testing"], ["created_at", "2021-03-24 21:14:53.886937"], ["updated_at", "2021-03-24 21:14:53.886937"], ["user_id", 1]]

  def set_tweeet
    @tweeet = Tweeet.find(params[:id])
---
SELECT "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]